# SQL Cheat Sheet: Aggregate Fuctions

___

## 0. Loading Database

In [1]:
%reload_ext sql

In [2]:
%%sql
postgresql://localhost/films

'Connected: @films'

___

## 1. Database Tables

In [3]:
%%sql 
-- Replace films whichever table (people/reviews/roles) you would like to see

SELECT * FROM films LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907),
 (2, 'Over the Hill to the Poorhouse', 1920, 'USA', 110, None, None, 3000000, 100000),
 (3, 'The Big Parade', 1925, 'USA', 151, None, 'Not Rated', None, 245000),
 (4, 'Metropolis', 1927, 'Germany', 145, 'German', 'Not Rated', 26435, 6000000),
 (5, "Pandora's Box", 1929, 'Germany', 110, 'German', 'Not Rated', 9950, None)]

___

## 2. Functions

- #### SUM

In [4]:
%%sql
-- Total Duration of all films
SELECT SUM(duration) FROM films;

 * postgresql://localhost/films
1 rows affected.

[(534882,)]

- #### AVG

In [5]:
%%sql
-- Average Duration of films
SELECT AVG(duration) FROM films;

 * postgresql://localhost/films
1 rows affected.

[(Decimal('107.9479313824419778'),)]

- #### MIN

In [6]:
%%sql
-- Duration of the shortest film
SELECT MIN(duration) FROM films;

 * postgresql://localhost/films
1 rows affected.

[(7,)]

- #### MAX

In [9]:
%%sql
-- Duration of the longest film
SELECT MAX(duration) FROM films;

 * postgresql://localhost/films
1 rows affected.

[(334,)]

___

## 3. Used in Combination

In [10]:
%%sql     
-- total amount grossed by all films made in the year 2000 or later.
SELECT SUM(gross) FROM films
WHERE release_year >= 2000;

 * postgresql://localhost/films
1 rows affected.

[(Decimal('150900926358'),)]

In [12]:
%%sql
-- Average amount grossed by all films whose titles start with the letter 'A'.
SELECT AVG(gross) FROM films
WHERE title LIKE 'A%';

 * postgresql://localhost/films
1 rows affected.

[(Decimal('47893236.422480620155'),)]

In [13]:
%%sql
-- Amount grossed by the worst performing film in 1994.
SELECT MIN(gross) FROM films
WHERE release_year = 1994

 * postgresql://localhost/films
1 rows affected.

[(125169,)]

In [14]:
%%sql
-- Amount grossed by the best performing film between 2000 and 2012, inclusive.
SELECT MAX(gross) FROM films
WHERE release_year BETWEEN 2000 AND 2012;

 * postgresql://localhost/films
1 rows affected.

[(760505847,)]

___

## 4. HAVING AGG( )
#### Filter Using Aggregate Function
- In SQL, aggregate functions can't be used in WHERE clauses. For example, the following query is invalid:
> SELECT release_year
FROM films
GROUP BY release_year
**WHERE COUNT(title) > 10;**

- This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the HAVING clause comes in. For example,
>SELECT release_year
FROM films
GROUP BY release_year
**HAVING COUNT(title) > 10;**

- Shows only those years in which more than 10 films were released.

In [15]:
%%sql
SELECT release_year, count(title) FROM films 
GROUP BY release_year
HAVING COUNT(*) > 10
LIMIT 5;

 * postgresql://localhost/films
5 rows affected.

[(1988, 31), (None, 42), (2008, 225), (1991, 31), (1989, 33)]

- write a query that returns the average budget and average gross earnings for films in each year after 1990, if the average budget is greater than $60 million.

In [17]:
%%sql
SELECT release_year, 
       AVG(budget) AS avg_budget,
       AVG(gross) AS avg_gross 
FROM films
WHERE release_year > 1990
GROUP BY release_year
HAVING AVG(budget) > 60000000
ORDER BY release_year;

 * postgresql://localhost/films
2 rows affected.

[(2005, Decimal('70323938.231527093596'), Decimal('41159143.290640394089')),
 (2006, Decimal('93968929.577464788732'), Decimal('39237855.953703703704'))]